In [1]:
import numpy as np

In [2]:
import pandas as pd

In [11]:
seller = {'item':['apple','apple','orrange','orrange','guns','guns','guns'],
          'days':['mon','tue','wed','thu','fri','sat','sun'],
             'sales':[100,80,200,100,5,10,5]}

In [12]:
seller

{'item': ['apple', 'apple', 'orrange', 'orrange', 'guns', 'guns', 'guns'],
 'days': ['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'],
 'sales': [100, 80, 200, 100, 5, 10, 5]}

In [13]:
#converting into data frmase
df = pd.DataFrame(seller)

In [14]:
df

      item days  sales
0    apple  mon    100
1    apple  tue     80
2  orrange  wed    200
3  orrange  thu    100
4     guns  fri      5
5     guns  sat     10
6     guns  sun      5

In [10]:
# by the using of groupby method we are going to
# group this datas by the smiller items

In [15]:
x = df.groupby('item')

In [16]:
x

In [17]:
x.mean()

              sales
item
apple     90.000000
guns       6.666667
orrange  150.000000

In [20]:
#mean of apple
(100+80)/2 #because we are using apple two times

90.0

In [21]:
#menas of orrange
(200+100)/2

150.0

In [23]:
#mena of guns 
(5+10+5)/3

6.666666666666667

In [24]:
x.mean()

              sales
item
apple     90.000000
guns       6.666667
orrange  150.000000

In [25]:
x.count() #depending on the item

         days  sales
item
apple       2      2
guns        3      3
orrange     2      2

In [26]:
#minimum and maximum of eache items

In [27]:
x.min()

        days  sales
item
apple    mon     80
guns     fri      5
orrange  thu    100

In [28]:
x.max()

        days  sales
item
apple    tue    100
guns     sun     10
orrange  wed    200